import pandas as pd

In [1]:
#pandas is defined as an open source library that provides
#high performance data manipulation in python
#data analysis requires loyt of processing restruction,cleaning,mergin,manipulating etc..we prefer pandas to perform 
#above functionalities bcoz it is fast simple than other tasks 
#pandas is built on numpy is required for operating
#pandas

In [2]:
#pandas series
#pandas series is a data strusture with one 
#dimensional labeled array
#it is primay building block of dataframe making its
#rows and columns

In [4]:
labels=['a','b','c']
my_data=[10,20,30]
arr=np.array(my_data)
d={'a':100,'b':200,'c':300}

NameError: name 'np' is not defined

In [5]:
#syntax-->pandas.series(data=none,index=none,dtype=none,name=none,copy=true (or)false)

In [9]:
import pandas as pd
pd.Series(my_data)

0    10
1    20
2    30
dtype: int64

In [11]:
pd.Series(data=[print,len,sum])

0    <built-in function print>
1      <built-in function len>
2      <built-in function sum>
dtype: object

In [12]:
class profile:
    def display(self):
        print("my name is pravalli")
p=profile()
p.display()

my name is pravalli

In [13]:
def decor(func):
    def inner():
        str1=func()
        return str1.upper()
    return inner()
def greet():
    return "good morning"
print(greet())

good morning

In [16]:
ser1=pd.Series([1,2,3,4,5],["USA","india","canada","uk","egypt"])
ser1

USA       1
india     2
canada    3
uk        4
egypt     5
dtype: int64

In [18]:
ser1[0]

1

In [19]:
ser1[0:3]

USA       1
india     2
canada    3
dtype: int64

In [22]:
ser2=pd.Series([1,2,3,4,5],["brazil","newzealand","australia","USA","antarctica"])
ser1+ser2

USA           5.0
antarctica    NaN
australia     NaN
brazil        NaN
canada        NaN
egypt         NaN
india         NaN
newzealand    NaN
uk            NaN
dtype: float64

In [23]:
ser2['china']="duplicate"

In [24]:
ser2

brazil                1
newzealand            2
australia             3
USA                   4
antarctica            5
china         duplicate
dtype: object

In [25]:
ser2.drop('USA')

brazil                1
newzealand            2
australia             3
antarctica            5
china         duplicate
dtype: object

In [29]:
import numpy as np
df=pd.DataFrame(np.random.randn(5,4))
df

          0         1         2         3
0  2.118571  1.257846  0.656301  0.562371
1  0.367179  0.459258  0.282926 -1.618044
2  0.920138  1.586238  0.307242 -0.702351
3 -0.067614 -0.365044  0.569659  1.086362
4 -0.967009 -0.581811  1.351997 -0.916778

In [3]:
df=pd.DataFrame(np.random.randn(5,4),['a','b','c','d','e'],['w','x','y','z'])
df

          w         x         y         z
a  0.729457  0.233133  0.222263  1.317917
b  0.061090  1.322181 -0.239994  1.125008
c  0.488722 -0.747275  0.558603  0.722763
d  0.175751  0.299453  0.908647 -0.025361
e -2.256402  0.933030  0.646697 -1.706080

In [32]:
#to convert a dictionary to data frame
d={"col1":[1,2],"col2":[3,4],"col3":[5,6]}
df=pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     3     5
1     2     4     6

In [1]:
import numpy as np
import pandas as pd
df=pd.DataFrame(np.random.randn(5,4))
df

          0         1         2         3
0  0.027953  1.086601 -0.195995  0.447024
1  0.735825 -1.787736 -0.650663  1.441367
2 -0.218475 -0.775138 -0.582895 -0.129185
3  0.224895 -1.604742 -0.121017 -0.848807
4  1.105509  0.305779 -0.153057  0.172067

In [2]:
df.T

          0         1         2         3         4
0  0.027953  0.735825 -0.218475  0.224895  1.105509
1  1.086601 -1.787736 -0.775138 -1.604742  0.305779
2 -0.195995 -0.650663 -0.582895 -0.121017 -0.153057
3  0.447024  1.441367 -0.129185 -0.848807  0.172067

In [4]:
df

          w         x         y         z
a  0.729457  0.233133  0.222263  1.317917
b  0.061090  1.322181 -0.239994  1.125008
c  0.488722 -0.747275  0.558603  0.722763
d  0.175751  0.299453  0.908647 -0.025361
e -2.256402  0.933030  0.646697 -1.706080

In [5]:
df.T

          a         b         c         d         e
w  0.729457  0.061090  0.488722  0.175751 -2.256402
x  0.233133  1.322181 -0.747275  0.299453  0.933030
y  0.222263 -0.239994  0.558603  0.908647  0.646697
z  1.317917  1.125008  0.722763 -0.025361 -1.706080

In [6]:
df.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [7]:
df.values

array([[ 0.72945655,  0.23313252,  0.22226343,  1.31791686],
       [ 0.06108953,  1.32218089, -0.23999397,  1.12500759],
       [ 0.48872246, -0.74727509,  0.55860321,  0.72276283],
       [ 0.1757512 ,  0.29945309,  0.90864684, -0.02536051],
       [-2.25640161,  0.93303014,  0.64669671, -1.70608035]])

In [8]:
df.columns

Index(['w', 'x', 'y', 'z'], dtype='object')

In [9]:
type(df)

pandas.core.frame.DataFrame

In [10]:
df.dtypes

w    float64
x    float64
y    float64
z    float64
dtype: object

In [11]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, a to e
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   w       5 non-null      float64
 1   x       5 non-null      float64
 2   y       5 non-null      float64
 3   z       5 non-null      float64
dtypes: float64(4)
memory usage: 372.0+ bytes

In [12]:
df.axes

[Index(['a', 'b', 'c', 'd', 'e'], dtype='object'),
 Index(['w', 'x', 'y', 'z'], dtype='object')]

In [13]:
df.size

20

In [14]:
df.ndim

2

In [15]:
df

          w         x         y         z
a  0.729457  0.233133  0.222263  1.317917
b  0.061090  1.322181 -0.239994  1.125008
c  0.488722 -0.747275  0.558603  0.722763
d  0.175751  0.299453  0.908647 -0.025361
e -2.256402  0.933030  0.646697 -1.706080

In [16]:
df['w']

a    0.729457
b    0.061090
c    0.488722
d    0.175751
e   -2.256402
Name: w, dtype: float64

In [17]:
df{['w','y']}

SyntaxError: invalid syntax (4002840733.py, line 1)

In [18]:
df['new']=df['w']+df['y']

In [19]:
df

          w         x         y         z       new
a  0.729457  0.233133  0.222263  1.317917  0.951720
b  0.061090  1.322181 -0.239994  1.125008 -0.178904
c  0.488722 -0.747275  0.558603  0.722763  1.047326
d  0.175751  0.299453  0.908647 -0.025361  1.084398
e -2.256402  0.933030  0.646697 -1.706080 -1.609705

In [22]:
df.drop('new',axis=1)

          w         x         y         z
a  0.729457  0.233133  0.222263  1.317917
b  0.061090  1.322181 -0.239994  1.125008
c  0.488722 -0.747275  0.558603  0.722763
d  0.175751  0.299453  0.908647 -0.025361
e -2.256402  0.933030  0.646697 -1.706080

In [23]:
df.drop('new',axis=1,implace=True)

TypeError: DataFrame.drop() got an unexpected keyword argument 'implace'